// Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. 
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string input = "sTYRweQ72-"; 
string result = input.ToLower(); //Преобразование заглавных букв в строчные
Console.WriteLine(result);